--이유미

--------------------------------------------------------------------------------
-- D-1. 교육 과정 조회
--  1) 개설 과정 상세 조회
--------------------------------------------------------------------------------



--------------------------------------------------------------------------------
-- D-1.1) 개설 과정 상세 조회
--------------------------------------------------------------------------------
-- 과정명, 과목명 및 기간, 담당 교사 출력
--------------------------------------------------------------------------------
select
    oc_seq as "번호",
    teacher_name as "교사명",
    course_name as "과정명",
    oc_startdate as "과정 시작일",
    oc_enddate as "과정 종료일",
    subject_name as "과목명",
    os_startdate as "과목 시작일",
    os_enddate as "과목 종료일"
from vwOpenCourseInfo
order by oc_startdate desc;