----------------------------------------------------------------------------------------------------------------------
--D-2. 면접 신청 및 일자 조회
--(조회한 교육 과정을 바탕으로 희망하는 교육과정과 일자를 선택하여 면접을 신청할 수 있다.)
----------------------------------------------------------------------------------------------------------------------
--D-2-1. 희망하는 면접 일자를 선택하여 면접 신청을 한다.
----------------------------------------------------------------------------------------------------------------------

--뷰사용 (개설 교육과정을 과정명으로 검색하기)
select 
        oc_seq as "개설과정",
        course_name as "과정명",
        oc_startdate as "과정시작일"
from vwcourseinfo where  instr(course_name, '웹') >0 ;



--면접일을 입력하는 시스템 시간이 과정 시작일보다 빠른지 확인한 뒤 insert
set serverout on;

declare
    vdate date;
begin
    select oc_startdate into vdate from vwCourseInfo where oc_seq =22;
     if vdate >= to_date(sysdate,'yy/mm/dd') then
        insert into tblInterviewer(interviewer_seq, interviewer_name, interviewer_tel, oc_seq, interviewer_date)
        values (interviewer_seq.nextval, 
        '희망', --이름
        '010-1111-2222', --번호 
        22, --희망과정
        to_date('2021-12-21', --면접 희망날짜 <개설과정 시작일
        'YY-MM-DD') 
        );
        dbms_output.put_line('입력 완료');  
    end if;
end;

----------------------------------------------------------------------------------------------------------------------
--D-2-2. 면접 신청한 뒤 관리자의 승인을 받아 확정 면접일자가 결정된다. > 관리자 확정면접일자
--D-2-3. 면접일자가 확정되면 확정 면접 일자 조회가 가능하다.
----------------------------------------------------------------------------------------------------------------------
--뷰사용
select ensuredate from vwinterviewinfo
--where seq = 1;--면접번호로 면접일자 조회
--where name ='탁경아';--면접자명로 면접일자 조회
where substr(tel, -4)= '2161';--전화번호 뒤 4자리로 면접일자 조회



----------------------------------------------------------------------------------------------------------------------
--D-2-4.추후 면접 실시 후 면접 통과 여부 조회가 가능하다. 
----------------------------------------------------------------------------------------------------------------------
--뷰사용
select result from vwinterviewinfo
--where seq = 1;
--where name ='탁경아';
where substr(tel, -4)= '2161';